Revit 2024 API
BasicFileInfo.CentralPath Property
 Returns the central model path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string CentralPath { get; }
Visual Basic
Public ReadOnly Property CentralPath As String
	Get
Visual C++
public:
property String^ CentralPath {
	String^ get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace